==================
hash known hosts = yes
==================

HashKnownHosts yes

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
hash known hosts = Yes
==================

HashKnownHosts Yes

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
hash known hosts = true
==================

HashKnownHosts true

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
hash known hosts = True
==================

HashKnownHosts True

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
hash known hosts = no
==================

HashKnownHosts no

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
hash known hosts = No
==================

HashKnownHosts No

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
hash known hosts = false
==================

HashKnownHosts false

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
hash known hosts = False
==================

HashKnownHosts False

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
use irregular casing
==================

HashKnownHOSts yes

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
can use equals sign
==================

HashKnownHOSts=yes

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
can use equals sign with whitespace
==================

HashKnownHOSts = yes

---

(client_config
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
can be specified after host
==================

Host example.com
  HashKnownHosts no

---

(client_config
  (host
    (host_value))
  (hash_known_hosts
    (hash_known_hosts_value)))

==================
detect invalid values
==================

HashKnownHOSts ja

---

(client_config
  (ERROR
    (UNEXPECTED 'j')))
