==================
use file from user home
==================

IdentityFile ~/.ssh/id_rsa

---

(client_config
  (identity_file
    (identity_file_value)))

==================
use irregular casing
==================

IdentityFILe ~/.ssh/id_rsa

---

(client_config
  (identity_file
    (identity_file_value)))

==================
can use equals sign
==================

IdentityFILe=~/.ssh/id_rsa

---

(client_config
  (identity_file
    (identity_file_value)))

==================
can use equals sign with whitespace
==================

IdentityFILe = ~/.ssh/id_rsa

---

(client_config
  (identity_file
    (identity_file_value)))

==================
can use equals sign with whitespace and quotes
==================

IdentityFILe = "~/.ssh/id_rsa"

---

(client_config
  (identity_file
    (identity_file_value)))

==================
can be specified after host
==================

Host example.com
  IdentityFile ~/.ssh/id_rsa

---

(client_config
  (host
    (host_value))
  (identity_file
    (identity_file_value)))

==================
requires whitespace after key
==================

IdentityFile"~/.ssh/id_rsa"

---

(client_config
  (ERROR
    (UNEXPECTED '~')))
