==================
identities only = yes
==================

IdentitiesOnly yes

---

(client_config
  (identities_only
    (identities_only_value)))

==================
identities only = Yes
==================

IdentitiesOnly Yes

---

(client_config
  (identities_only
    (identities_only_value)))

==================
identities only = true
==================

IdentitiesOnly true

---

(client_config
  (identities_only
    (identities_only_value)))

==================
identities only = True
==================

IdentitiesOnly True

---

(client_config
  (identities_only
    (identities_only_value)))

==================
identities only = no
==================

IdentitiesOnly no

---

(client_config
  (identities_only
    (identities_only_value)))

==================
identities only = No
==================

IdentitiesOnly No

---

(client_config
  (identities_only
    (identities_only_value)))

==================
identities only = false
==================

IdentitiesOnly false

---

(client_config
  (identities_only
    (identities_only_value)))

==================
identities only = False
==================

IdentitiesOnly False

---

(client_config
  (identities_only
    (identities_only_value)))

==================
use irregular casing
==================

IdentitIESOnly yes

---

(client_config
  (identities_only
    (identities_only_value)))

==================
can use equals sign
==================

IdentitIESOnly=yes

---

(client_config
  (identities_only
    (identities_only_value)))

==================
can use equals sign with whitespace
==================

IdentitIESOnly = yes

---

(client_config
  (identities_only
    (identities_only_value)))

==================
can be specified after host
==================

Host example.com
  IdentitiesOnly no

---

(client_config
  (host
    (host_value))
  (identities_only
    (identities_only_value)))

==================
detect invalid values
==================

IdentitIESOnly ja

---

(client_config
  (ERROR
    (UNEXPECTED 'j')))
