==================
include file
==================

Include some-other.config

---

(client_config
  (include
    (include_value)))

==================
use irregular casing
==================

iNClude some-other.config

---

(client_config
  (include
    (include_value)))

==================
can use equals sign
==================

iNClude=some-other.config

---

(client_config
  (include
    (include_value)))

==================
can use equals sign with whitespace
==================

iNClude = some-other.config

---

(client_config
  (include
    (include_value)))

==================
can use equals sign with whitespace and quotes
==================

iNClude = "some-other.config"

---

(client_config
  (include
    (include_value)))

==================
can be specified after host
==================

Host example.com
  Include some-other.config

---

(client_config
  (host
    (host_value))
  (include
    (include_value)))

==================
requires whitespace after key
==================

Include"some-other.config"

---

(client_config
  (ERROR
    (UNEXPECTED 'o')))
