==================
run command after connect
==================

LocalCommand some-command arg1 arg2

---

(client_config
  (local_command
    (local_command_value)))

==================
use irregular casing
==================

LocalComMANd some-command arg1 arg2

---

(client_config
  (local_command
    (local_command_value)))

==================
can use equals sign
==================

LocalCommand=some-command arg1 arg2

---

(client_config
  (local_command
    (local_command_value)))

==================
can use equals sign with whitespace
==================

LocalCommand = some-command arg1 arg2

---

(client_config
  (local_command
    (local_command_value)))

==================
can use equals sign with whitespace and quotes
==================

LocalCommand = "some-command arg1 arg2"

---

(client_config
  (local_command
    (local_command_value)))

==================
can be specified after host
==================

Host example.com
  LocalCommand some-command arg1 arg2

---

(client_config
  (host
    (host_value))
  (local_command
    (local_command_value)))

==================
requires whitespace after key
==================

LocalCommand"some-command arg1 arg2"

---

(client_config
  (ERROR
    (UNEXPECTED 'o')
    (UNEXPECTED 'r')))
