==================
forward port
==================

RemoteForward 8080

---

(client_config
  (remote_forward
    (remote_forward_value)))

==================
forward address:port
==================

RemoteForward 0.0.0.0:1234

---

(client_config
  (remote_forward
    (remote_forward_value)))

==================
forward using localhost
==================

RemoteForward localhost:9095

---

(client_config
  (remote_forward
    (remote_forward_value)))

==================
forward on all interfaces
==================

RemoteForward *:3000

---

(client_config
  (remote_forward
    (remote_forward_value)))

==================
use irregular casing
==================

RemotefORward *:3000

---

(client_config
  (remote_forward
    (remote_forward_value)))

==================
can use equals sign
==================

RemoteForward=*:3000

---

(client_config
  (remote_forward
    (remote_forward_value)))

==================
can use equals sign with whitespace
==================

RemoteForward = *:3000

---

(client_config
  (remote_forward
    (remote_forward_value)))

==================
can be specified after host
==================

Host example.com
  RemoteForward *:3000

---

(client_config
  (host
    (host_value))
  (remote_forward
    (remote_forward_value)))
