==================
specify variable to send
==================

SendEnv RANDOM_VAR

---

(client_config
  (send_env
    (send_env_value)))

==================
send variable with wildcard
==================

SendEnv RANDOM_VA?

---

(client_config
  (send_env
    (send_env_value)))

==================
use irregular casing
==================

SendENV RANDOM_VA?

---

(client_config
  (send_env
    (send_env_value)))

==================
can use equals sign
==================

SendEnv=RANDOM_VA?

---

(client_config
  (send_env
    (send_env_value)))

==================
can use equals sign with whitespace
==================

SendEnv = RANDOM_VA?

---

(client_config
  (send_env
    (send_env_value)))

==================
can use equals sign with whitespace and quotes
==================

SendEnv = "RANDOM_VA?"

---

(client_config
  (send_env
    (send_env_value)))

==================
can be specified after host
==================

Host example.com
  SendEnv RANDOM_VA?

---

(client_config
  (host
    (host_value))
  (send_env
    (send_env_value)))

==================
requires whitespace after key
==================

SendEnv"RANDOM_VA?"

---

(client_config
  (ERROR
    (UNEXPECTED 'A')))
